tylertms/dspic33e-sim/conformance/can.c
static void overflow_and_fallback_cases(CanConformance* state, Dspic33* cpu) {
    Dspic33CanFrame input = frame(0x123u, false, false, 2u, 0x40u);
    dspic33_reset(cpu, 0u);
    configure_receive(cpu, 0u, 0x8000u, 4u, 0u);
    configure_filter(cpu, 0u, 0u, 0x123u, false, 0x7ffu, true, 1u, 0u);
    configure_filter(cpu, 0u, 1u, 0x123u, false, 0x7ffu, true, 2u, 0u);
    enable_filter(cpu, 0u, 3u);
    select_window(cpu, 0u, false);
    set_mode(cpu, 0u, 0u);
    expect(state,
           dspic33_can_receive(cpu, 0u, &input, 0u) && dspic33_device_advance(cpu, 32u),
           "fallback first transfer");
    expect(state, receive_full(cpu, 0u, 1u), "fallback first buffer");
    expect(state,
           dspic33_can_receive(cpu, 0u, &input, 0u) && dspic33_device_advance(cpu, 32u),
           "fallback second transfer");
    expect(state, receive_full(cpu, 0u, 2u), "fallback second buffer");
    expect(state,
           dspic33_can_receive(cpu, 0u, &input, 0u) && dspic33_device_advance(cpu, 2u),
           "fallback overflow attempt");
    expect(state, (dspic33_read_word(cpu, 0x0428u) & 2u) != 0u,
           "fallback lowest overflow");
}

static void transmission_cases(CanConformance* state, Dspic33* cpu) {
    uint8_t channel;
    uint8_t extended;
    uint8_t remote;
    for (channel = 0u; channel < DSPIC33_CAN_COUNT; channel++) {
        for (extended = 0u; extended < 2u; extended++) {
            for (remote = 0u; remote < 2u; remote++) {
                uint16_t base = bases[channel];
                uint32_t memory = (uint32_t)(0x9000u + channel * 0x1000u);
                Dspic33CanFrame expected =
                    frame(extended != 0u ? 0x1234567u : 0x345u, extended != 0u,
                          remote != 0u, 8u, (uint8_t)(0x50u + extended * 8u));
                Dspic33CanFrame actual;
                uint16_t words[8] = {0};
                uint8_t index;
                uint32_t sid = expected.extended ? (expected.identifier >> 18u) & 0x7ffu
                                                 : expected.identifier;
                uint32_t eid = expected.identifier & 0x3ffffu;
                words[0] = (uint16_t)(sid << 2u);
                if (expected.extended) {
                    words[0] |= 3u;
                    words[1] = (uint16_t)(eid >> 6u);
                    words[2] = (uint16_t)((eid & 0x3fu) << 10u);
                    if (expected.remote) {
                        words[2] |= 0x0200u;
                    }
                } else if (expected.remote) {
                    words[0] |= 2u;
                }
                words[2] |= expected.length;
                for (index = 0u; index < expected.length; index++) {
                    words[3u + index / 2u] |= (uint16_t)expected.data[index]
                                              << ((index & 1u) * 8u);
                }
                dspic33_reset(cpu, 0u);
                configure_transmit(cpu, channel, memory);
                for (index = 0u; index < 8u; index++) {
                    write_memory_word(cpu, memory + index * 2u, words[index]);
                }
                select_window(cpu, channel, false);
                set_mode(cpu, channel, 0u);
                dspic33_write_word(cpu, (uint16_t)(base + 0x0cu), 1u);
                dspic33_write_word(cpu, (uint16_t)(base + 0x30u), 0x008bu);
                expect(state, dspic33_device_advance(cpu, 4096u), "transmit advance");
                expect(state, dspic33_can_transmit(cpu, channel, &actual),
                       "transmit queue output");
                expect(state,
                       actual.identifier == expected.identifier &&
                           actual.extended == expected.extended &&
                           actual.remote == expected.remote &&
                           actual.length == expected.length,
                       "transmit frame header");
                expect(state, memcmp(actual.data, expected.data, 8u) == 0,
                       "transmit payload");
                expect(state,
                       (dspic33_read_word(cpu, (uint16_t)(base + 0x30u)) & 8u) == 0u,
                       "transmit request clear");
                expect(state,
                       (dspic33_read_word(cpu, (uint16_t)(base + 0x0au)) & 1u) != 0u,
                       "transmit event flag");
                expect(state, interrupt_flag(cpu, event_irqs[channel]),
                       "transmit event interrupt");
            }
        }
    }
}

static void clock_timing_cases(CanConformance* state, Dspic33* cpu) {
    static const uint16_t clock_controls[] = {0u, 0x0800u, 0u, 0u};
    static const uint16_t config1_values[] = {0u, 0u, 1u, 0u};
    static const uint16_t config2_values[] = {0u, 0u, 0u, 0x0311u};
    static const uint64_t completion_cycles[] = {208u, 408u, 408u, 508u};
    for (uint8_t channel = 0u; channel < DSPIC33_CAN_COUNT; channel++) {
        for (uint8_t timing = 0u;
             timing < sizeof(completion_cycles) / sizeof(completion_cycles[0]);
             timing++) {
            uint16_t base = bases[channel];
            uint32_t memory = (uint32_t)(0xb800u + channel * 0x100u);
            Dspic33CanFrame output;
            dspic33_reset(cpu, 0u);
            configure_transmit(cpu, channel, memory);
            write_memory_word(cpu, memory, 2u);
            for (uint8_t word = 1u; word < 8u; word++) {
                write_memory_word(cpu, memory + word * 2u, 0u);
            }
            select_window(cpu, channel, false);
            set_mode(cpu, channel, 4u);
            dspic33_write_word(cpu, (uint16_t)(base + 0x10u), config1_values[timing]);
            dspic33_write_word(cpu, (uint16_t)(base + 0x12u), config2_values[timing]);
            dspic33_write_word(cpu, base,
                               (uint16_t)((dspic33_read_word(cpu, base) & ~0x0800u) |
                                          clock_controls[timing]));
            set_mode(cpu, channel, 0u);
            dspic33_write_word(cpu, (uint16_t)(base + 0x30u), 0x008bu);
            expect(state,
                   dspic33_read_word(cpu, (uint16_t)(base + 0x10u)) ==
                           config1_values[timing] &&
                       dspic33_read_word(cpu, (uint16_t)(base + 0x12u)) ==
                           config2_values[timing] &&
                       (dspic33_read_word(cpu, base) & 0x0800u) ==
                           clock_controls[timing],
                   "CAN bit timing configuration is retained");
            expect(state,
                   dspic33_device_advance(cpu, completion_cycles[timing] - 1u) &&
                       !dspic33_can_transmit(cpu, channel, &output),
                   "CAN frame remains active before its final bus bit");
            expect(state,
                   dspic33_device_advance(cpu, 1u) &&
                       dspic33_can_transmit(cpu, channel, &output) &&
                       output.identifier == 0u && output.remote && output.length == 0u,
                   "CAN frame completes on its configured B1 clock boundary");
        }
    }
}

static void stuffed_frame_timing_cases(CanConformance* state, Dspic33* cpu) {
    static const uint16_t words[][8] = {
        {0x0c84u, 0u, 1u, 0x00a5u, 0u, 0u, 0u, 0u},
        {0x0123u, 0x0d15u, 0x9c08u, 0x0100u, 0x0302u, 0x0504u, 0x0706u, 0u},
    };
    static const uint64_t completion_cycles[] = {236u, 576u};
    for (uint8_t channel = 0u; channel < DSPIC33_CAN_COUNT; channel++) {
        for (uint8_t frame_index = 0u;
             frame_index < sizeof(completion_cycles) / sizeof(completion_cycles[0]);
             frame_index++) {
            uint16_t base = bases[channel];
            uint32_t memory = (uint32_t)(0xba00u + channel * 0x100u);
            Dspic33CanFrame output;
            dspic33_reset(cpu, 0u);
            configure_transmit(cpu, channel, memory);
            for (uint8_t word = 0u; word < 8u; word++) {
                write_memory_word(cpu, memory + word * 2u, words[frame_index][word]);
            }
            select_window(cpu, channel, false);
            set_mode(cpu, channel, 0u);
            dspic33_write_word(cpu, (uint16_t)(base + 0x30u), 0x008bu);
            expect(state,
                   dspic33_device_advance(cpu, completion_cycles[frame_index] - 1u) &&
                       !dspic33_can_transmit(cpu, channel, &output),
                   "stuffed CAN frame remains active before its calculated boundary");
            expect(state,
                   dspic33_device_advance(cpu, 1u) &&
                       dspic33_can_transmit(cpu, channel, &output) &&
                       output.extended == (frame_index != 0u) &&
                       output.length == (frame_index == 0u ? 1u : 8u),
                   "stuffed CAN frame completes on its calculated boundary");
        }
    }
}

static void transmit_abort_timing_cases(CanConformance* state, Dspic33* cpu) {
    for (uint8_t channel = 0u; channel < DSPIC33_CAN_COUNT; channel++) {
        uint16_t base = bases[channel];
        uint32_t memory = (uint32_t)(0xbc00u + channel * 0x100u);
        Dspic33CanFrame output;
        dspic33_reset(cpu, 0u);
        configure_transmit(cpu, channel, memory);
        write_memory_word(cpu, memory, 2u);
        for (uint8_t word = 1u; word < 8u; word++) {
            write_memory_word(cpu, memory + word * 2u, 0u);
        }
        select_window(cpu, channel, false);
        set_mode(cpu, channel, 0u);
        dspic33_write_word(cpu, (uint16_t)(base + 0x30u), 0x008bu);
        expect(state,
               dspic33_device_advance(cpu, 8u) &&
                   (cpu->io.can_tx_busy & (uint8_t)(1u << channel)) != 0u &&
                   !dspic33_can_transmit(cpu, channel, &output),
               "CAN abort test reaches the on-bus interval");
        dspic33_write_word(cpu, base,
                           (uint16_t)(dspic33_read_word(cpu, base) | 0x1000u));
        expect(state,
               (cpu->io.can_tx_busy & (uint8_t)(1u << channel)) == 0u &&
                   (dspic33_read_word(cpu, (uint16_t)(base + 0x30u)) & 0x0048u) ==
                       0x0040u &&
                   dspic33_device_advance(cpu, 1000u) &&
                   !dspic33_can_transmit(cpu, channel, &output),
               "CAN abort cancels the pending on-bus completion");

        dspic33_reset(cpu, 0u);
        configure_transmit(cpu, channel, memory);
        write_memory_word(cpu, memory, 2u);
        for (uint8_t word = 1u; word < 8u; word++) {
            write_memory_word(cpu, memory + word * 2u, 0u);
        }
        select_window(cpu, channel, false);
        set_mode(cpu, channel, 0u);
        dspic33_write_word(cpu, (uint16_t)(base + 0x30u), 0x008bu);
        expect(state,
               dspic33_device_advance(cpu, 8u) &&
                   (cpu->io.can_tx_busy & (uint8_t)(1u << channel)) != 0u,
               "individual CAN abort reaches the on-bus interval");
        dspic33_write_word(cpu, (uint16_t)(base + 0x30u), 0x0083u);
        expect(state,
               (cpu->io.can_tx_busy & (uint8_t)(1u << channel)) == 0u &&
                   (dspic33_read_word(cpu, (uint16_t)(base + 0x30u)) & 0x0048u) ==
                       0x0040u &&
                   dspic33_device_advance(cpu, 1000u) &&
                   !dspic33_can_transmit(cpu, channel, &output),
               "clearing TXREQ aborts the active CAN transmission");
    }
}

static void transmit_pps_cases(CanConformance* state, Dspic33* cpu) {
    bool high;
    expect(state, !dspic33_can_pin(cpu, 64u, NULL),
           "CAN output rejects null pin level");
    expect(state, !dspic33_can_pin(cpu, 63u, &high),
           "CAN output rejects non-remappable pin");
    for (uint8_t channel = 0u; channel < DSPIC33_CAN_COUNT; channel++) {
        uint16_t base = bases[channel];
        uint32_t memory = (uint32_t)(0xbe00u + channel * 0x100u);
        uint8_t function = (uint8_t)(14u + channel);
        dspic33_reset(cpu, 0u);
        dspic33_write_word(cpu, 0x0680u, function);
        expect(state, dspic33_can_pin(cpu, 64u, &high) && high,
               "mapped CAN transmit pin is recessive while idle");
        configure_transmit(cpu, channel, memory);
        for (uint8_t word = 0u; word < 8u; word++) {
            write_memory_word(cpu, memory + word * 2u, 0u);
        }
        select_window(cpu, channel, false);
        set_mode(cpu, channel, 0u);
        dspic33_write_word(cpu, (uint16_t)(base + 0x30u), 0x008bu);
        expect(state,
               dspic33_device_advance(cpu, 8u) && dspic33_can_pin(cpu, 64u, &high) &&
                   !high,
               "CAN transmit pin drives dominant start of frame");
        expect(state,
               dspic33_device_advance(cpu, 20u) && dspic33_can_pin(cpu, 64u, &high) &&
                   high,
               "CAN transmit pin inserts the sixth complementary stuffed bit");
        expect(state,
               dspic33_device_advance(cpu, 4u) && dspic33_can_pin(cpu, 64u, &high) &&
                   !high,
               "CAN transmit pin resumes frame data after stuffing");
        dspic33_write_word(cpu, (uint16_t)(base + 0x30u), 0x0083u);
        expect(state, dspic33_can_pin(cpu, 64u, &high) && high,
               "aborted CAN transmit pin returns recessive");
        dspic33_write_word(cpu, 0x0680u, (uint16_t)(function << 8u));
        expect(state,
               !dspic33_can_pin(cpu, 64u, &high) && dspic33_can_pin(cpu, 65u, &high) &&
                   high,
               "CAN transmit output follows PPS remapping");
        dspic33_write_word(
            cpu, 0x0760u,
            (uint16_t)(dspic33_read_word(cpu, 0x0760u) | (uint16_t)(2u << channel)));
        expect(state,
               dspic33_device_advance(cpu, 1u) && !dspic33_can_pin(cpu, 65u, &high),
               "PMD releases the CAN transmit PPS output");

        dspic33_reset(cpu, 0u);
        dspic33_write_word(cpu, 0x0680u, function);
        configure_transmit(cpu, channel, memory);
        for (uint8_t word = 0u; word < 8u; word++) {
            write_memory_word(cpu, memory + word * 2u, 0u);
        }
        select_window(cpu, channel, false);
        set_mode(cpu, channel, 0u);
        dspic33_write_word(cpu, (uint16_t)(base + 0x30u), 0x008bu);
        expect(state,
               dspic33_device_advance(cpu, 8u) && dspic33_can_pin(cpu, 64u, &high) &&
                   !high,
               "CAN Sleep output test reaches dominant bus phase");
        cpu->power_state = DSPIC33_POWER_SLEEP;
        expect(state, dspic33_can_pin(cpu, 64u, &high) && high,
               "Sleep forces the CAN transmit pin recessive");
    }
}

static bool bridge_can_pins(Dspic33* cpu, uint8_t transmit_channel, uint8_t pin,
                            uint8_t acknowledge_pin, uint64_t bit_cycles,
                            int corrupt_bit, bool* acknowledge_observed) {
    uint16_t bit = 0u;
    while ((cpu->io.can_tx_on_bus & (uint8_t)(1u << transmit_channel)) != 0u &&
           bit < 160u) {
        bool high;
        bool acknowledge_high;
        if (dspic33_can_pin(cpu, acknowledge_pin, &acknowledge_high) &&
            !acknowledge_high) {
            *acknowledge_observed = true;
        }
        if (!dspic33_can_pin(cpu, pin, &high)) {
            return false;
        }
        if (bit == corrupt_bit) {
            high = !high;
        }
        if (!dspic33_can_input_pin(cpu, pin, high && acknowledge_high, 0u) ||
            !dspic33_device_advance(cpu, bit_cycles)) {
            return false;
        }
        bit++;
    }
    return bit != 0u && bit < 160u && dspic33_device_advance(cpu, 32u);
}

static bool drive_shared_can_bus(Dspic33* can1, Dspic33* can2, uint8_t active_channel,
                                 uint64_t bit_cycles) {
    uint16_t count = 0u;
    Dspic33* active = active_channel == 0u ? can1 : can2;
    while ((active->io.can_tx_on_bus & (uint8_t)(1u << active_channel)) != 0u &&
           count < 160u) {
        bool can1_high;
        bool can2_high;
        bool bus_high;
        if (!dspic33_can_pin(can1, 65u, &can1_high) ||
            !dspic33_can_pin(can2, 66u, &can2_high)) {
            return false;
        }
        bus_high = can1_high && can2_high;
        if (!dspic33_can_input_pin(can1, 64u, bus_high, 0u) ||
            !dspic33_can_input_pin(can2, 64u, bus_high, 0u) ||
            !dspic33_device_advance(can1, bit_cycles) ||
            !dspic33_device_advance(can2, bit_cycles)) {
            return false;
        }
        count++;
    }
    return count != 0u && count < 160u;
}

static void arbitration_field_cases(CanConformance* state, Dspic33* cpu) {
    Dspic33CanFrame contenders[4][2];
    Dspic33 winner;
    contenders[0][0] = frame(0x155u, false, false, 0u, 0u);
    contenders[0][1] = frame(0x155u, false, true, 0u, 0u);
    contenders[1][0] = frame(0x155u, false, false, 0u, 0u);
    contenders[1][1] = frame(0x5540000u, true, false, 0u, 0u);
    contenders[2][0] = frame(0x1550000u, true, false, 0u, 0u);
    contenders[2][1] = frame(0x1550001u, true, false, 0u, 0u);
    contenders[3][0] = frame(0x1550000u, true, false, 0u, 0u);
    contenders[3][1] = frame(0x1550000u, true, true, 0u, 0u);
    expect(state, dspic33_initialize(&winner),
           "initialize independent CAN arbitration contender");
    for (uint8_t index = 0u; index < 4u; index++) {
        Dspic33CanFrame output;
        dspic33_reset(cpu, 0u);
        dspic33_reset(&winner, 0u);
        dspic33_write_word(cpu, 0x0e30u, 0xffffu);
        dspic33_write_word(cpu, 0x0e3eu, 0u);
        dspic33_write_word(cpu, 0x0680u, 0x0e00u);
        dspic33_write_word(cpu, 0x06d4u, 0x0040u);
        dspic33_write_word(&winner, 0x0e30u, 0xffffu);
        dspic33_write_word(&winner, 0x0e3eu, 0u);
        dspic33_write_word(&winner, 0x0682u, 0x000fu);
        dspic33_write_word(&winner, 0x06d4u, 0x4000u);
        configure_transmit(cpu, 0u, 0xd400u);
        configure_transmit(&winner, 1u, 0xd600u);
        write_transmit_frame(cpu, 0xd400u, &contenders[index][0]);
        write_transmit_frame(&winner, 0xd600u, &contenders[index][1]);
        select_window(cpu, 0u, false);
        select_window(&winner, 1u, false);
        dspic33_write_word(cpu, 0x0410u, 0u);
        dspic33_write_word(cpu, 0x0412u, 0u);
        dspic33_write_word(&winner, 0x0510u, 0u);
        dspic33_write_word(&winner, 0x0512u, 0u);
        set_mode(cpu, 0u, 0u);
        set_mode(&winner, 1u, 0u);
        dspic33_write_word(cpu, 0x0430u, 0x008bu);
        dspic33_write_word(&winner, 0x0530u, 0x008bu);
        expect(state,
               dspic33_device_advance(cpu, 8u) && dspic33_device_advance(&winner, 8u) &&
                   (cpu->io.can_tx_on_bus & 1u) != 0u &&
                   (winner.io.can_tx_on_bus & 2u) != 0u,
               "CAN arbitration field contenders start together");
        expect(state, drive_shared_can_bus(cpu, &winner, 0u, 4u),
               "CAN arbitration field selects the dominant contender");
        expect(state,
               (dspic33_read_word(&winner, 0x0530u) & 0x0028u) == 0x0028u &&
                   dspic33_can_transmit(cpu, 0u, &output) &&
                   output.identifier == contenders[index][0].identifier &&
                   output.extended == contenders[index][0].extended &&
                   output.remote == contenders[index][0].remote,
               "CAN arbitration field records loss and completes the winner");
    }
    dspic33_destroy(&winner);
}

static void arbitration_cases(CanConformance* state, Dspic33* cpu) {
    Dspic33CanFrame higher = frame(0x400u, false, false, 2u, 0xa0u);
    Dspic33CanFrame lower = frame(0u, false, false, 2u, 0xb0u);
    Dspic33CanFrame output;
    Dspic33 winner;
    expect(state, dspic33_initialize(&winner),
           "initialize independent CAN arbitration winner");
    dspic33_reset(cpu, 0u);
    dspic33_reset(&winner, 0u);
    dspic33_write_word(cpu, 0x0e30u, 0xffffu);
    dspic33_write_word(cpu, 0x0e3eu, 0u);
    dspic33_write_word(cpu, 0x0680u, 0x0e00u);
    dspic33_write_word(cpu, 0x06d4u, 0x0040u);
    dspic33_write_word(&winner, 0x0e30u, 0xffffu);
    dspic33_write_word(&winner, 0x0e3eu, 0u);
    dspic33_write_word(&winner, 0x0682u, 0x000fu);
    dspic33_write_word(&winner, 0x06d4u, 0x4000u);
    configure_receive(cpu, 0u, 0xd000u, 4u, 0u);
    configure_receive(&winner, 1u, 0xd200u, 4u, 0u);
    configure_filter(cpu, 0u, 0u, lower.identifier, false, 0x7ffu, true, 0u, 0u);
    configure_filter(&winner, 1u, 0u, higher.identifier, false, 0x7ffu, true, 0u, 0u);
    enable_filter(cpu, 0u, 1u);
    enable_filter(&winner, 1u, 1u);
    configure_transmit(cpu, 0u, 0xd400u);
    configure_transmit(&winner, 1u, 0xd600u);
    write_transmit_frame(cpu, 0xd400u, &higher);
    write_transmit_frame(&winner, 0xd600u, &lower);
    select_window(cpu, 0u, false);
    select_window(&winner, 1u, false);
    dspic33_write_word(cpu, 0x0410u, 0u);
    dspic33_write_word(cpu, 0x0412u, 0u);
    dspic33_write_word(&winner, 0x0510u, 0u);
    dspic33_write_word(&winner, 0x0512u, 0u);
    set_mode(cpu, 0u, 0u);
    set_mode(&winner, 1u, 0u);
    dspic33_write_word(cpu, 0x0430u, 0x008bu);
    dspic33_write_word(&winner, 0x0530u, 0x008bu);
    expect(state,
           dspic33_device_advance(cpu, 8u) && dspic33_device_advance(&winner, 8u) &&
               (cpu->io.can_tx_on_bus & 1u) != 0u &&
               (winner.io.can_tx_on_bus & 2u) != 0u,
           "competing CAN transmissions enter the bus together");
    expect(state, drive_shared_can_bus(cpu, &winner, 1u, 4u),
           "lower identifier wins CAN arbitration");
    expect(state,
           (dspic33_read_word(cpu, 0x0430u) & 0x0028u) == 0x0028u &&
               (cpu->io.can_tx_busy & 1u) != 0u && (cpu->io.can_tx_on_bus & 1u) == 0u &&
               !dspic33_can_transmit(cpu, 0u, &output),
           "losing CAN transmission records TXLARB and begins an automatic retry");
    expect(state,
           dspic33_can_transmit(&winner, 1u, &output) &&
               output.identifier == lower.identifier,
           "winning CAN frame completes before the retry");
    expect(state,
           cpu->io.can_rx_serial_count[0] != 0u && dspic33_device_advance(cpu, 7u) &&
               dspic33_device_advance(&winner, 7u) &&
               (cpu->io.can_tx_retry_wait & 1u) == 0u &&
               (cpu->io.can_tx_on_bus & 1u) != 0u,
           "losing node monitors the winner and retries after intermission");
    expect(state, drive_shared_can_bus(cpu, &winner, 0u, 4u),
           "retried CAN transmission completes on the shared bus");
    expect(state,
           dspic33_device_advance(cpu, 8u) && dspic33_can_transmit(cpu, 0u, &output) &&
               output.identifier == higher.identifier &&
               (dspic33_read_word(cpu, 0x0430u) & 0x0078u) == 0x0020u &&
               winner.io.can_rx_serial_count[1] != 0u,
           "successful retry preserves TXLARB and clears TXREQ without errors");
    dspic33_destroy(&winner);
}

static bool drive_unacknowledged_can_frame(Dspic33* cpu, uint8_t channel,
                                           uint8_t transmit_pin, uint8_t receive_pin,
                                           uint64_t bit_cycles) {
    uint16_t count = 0u;
    while ((cpu->io.can_tx_on_bus & (uint8_t)(1u << channel)) != 0u && count < 160u) {
        bool high;
        if (!dspic33_can_pin(cpu, transmit_pin, &high) ||
            !dspic33_can_input_pin(cpu, receive_pin, high, 0u) ||
            !dspic33_device_advance(cpu, bit_cycles)) {
            return false;
        }
        count++;
    }
    return count != 0u && count < 160u;
}

