tylertms/dspic33e-sim/conformance/can.c
static void acknowledge_error_cases(CanConformance* state, Dspic33* cpu) {
    for (uint8_t channel = 0u; channel < DSPIC33_CAN_COUNT; channel++) {
        uint16_t base = bases[channel];
        uint32_t memory = (uint32_t)(0xdc00u + channel * 0x100u);
        uint8_t function = (uint8_t)(14u + channel);
        Dspic33CanFrame output;
        bool high;
        dspic33_reset(cpu, 0u);
        dspic33_write_word(cpu, 0x0e30u, 0xffffu);
        dspic33_write_word(cpu, 0x0e3eu, 0u);
        dspic33_write_word(cpu, 0x0680u, function);
        dspic33_write_word(cpu, 0x06d4u, channel == 0u ? 65u : (uint16_t)(65u << 8u));
        configure_transmit(cpu, channel, memory);
        Dspic33CanFrame input = frame((uint32_t)(0x240u + channel), false, false, 1u,
                                      (uint8_t)(0xc0u + channel));
        write_transmit_frame(cpu, memory, &input);
        select_window(cpu, channel, false);
        dspic33_write_word(cpu, (uint16_t)(base + 0x10u), 0u);
        dspic33_write_word(cpu, (uint16_t)(base + 0x12u), 0u);
        set_mode(cpu, channel, 0u);
        dspic33_write_word(cpu, (uint16_t)(base + 0x30u), 0x008bu);
        expect(state,
               dspic33_device_advance(cpu, 8u) &&
                   (cpu->io.can_tx_on_bus & (uint8_t)(1u << channel)) != 0u,
               "unacknowledged CAN frame reaches the bus");
        expect(state, drive_unacknowledged_can_frame(cpu, channel, 64u, 65u, 4u),
               "unacknowledged CAN frame reaches the ACK slot");
        expect(state,
               (dspic33_read_word(cpu, (uint16_t)(base + 0x30u)) & 0x0018u) ==
                       0x0018u &&
                   (dspic33_read_word(cpu, (uint16_t)(base + 0x0eu)) >> 8u) == 8u &&
                   (dspic33_read_word(cpu, (uint16_t)(base + 0x0au)) & 1u) == 0u &&
                   (cpu->io.can_tx_error_active & (uint8_t)(1u << channel)) != 0u &&
                   !dspic33_can_transmit(cpu, channel, &output),
               "missing CAN ACK sets TXERR and TEC without completing transmission");
        expect(state, dspic33_can_pin(cpu, 64u, &high) && !high,
               "CAN acknowledge error emits an active error flag");
        if (channel == 0u) {
            Dspic33 copy;
            bool copy_high;
            expect(state, dspic33_initialize(&copy), "initialize CAN error-frame copy");
            expect(state,
                   dspic33_copy(&copy, cpu) && copy.io.can_tx_error_active == 1u &&
                       copy.io.can_tx_error_start_cycle[0] ==
                           cpu->io.can_tx_error_start_cycle[0],
                   "copy preserves active CAN error-frame phase");
            expect(state,
                   dspic33_device_advance(cpu, 24u) &&
                       dspic33_device_advance(&copy, 24u) &&
                       dspic33_can_pin(cpu, 64u, &high) && high &&
                       dspic33_can_pin(&copy, 64u, &copy_high) && copy_high &&
                       copy.io.can_tx_error_active == 1u,
                   "copied CAN error frames enter the recessive delimiter together");
            dspic33_destroy(&copy);
        } else {
            expect(state,
                   dspic33_device_advance(cpu, 24u) &&
                       dspic33_can_pin(cpu, 64u, &high) && high &&
                       (cpu->io.can_tx_error_active & (uint8_t)(1u << channel)) != 0u,
                   "CAN active error flag is followed by a recessive delimiter");
        }
        expect(
            state,
            dspic33_device_advance(cpu, 52u) &&
                (cpu->io.can_tx_error_active & (uint8_t)(1u << channel)) == 0u &&
                (cpu->io.can_tx_on_bus & (uint8_t)(1u << channel)) != 0u,
            "unacknowledged CAN transmission automatically retries after intermission");
        dspic33_write_word(cpu, (uint16_t)(base + 0x30u), 0x0093u);
        expect(state,
               (cpu->io.can_tx_busy & (uint8_t)(1u << channel)) == 0u &&
                   (cpu->io.can_tx_retry_wait & (uint8_t)(1u << channel)) == 0u &&
                   dspic33_can_pin(cpu, 64u, &high) && high,
               "aborting a retried CAN frame clears error-bus state");
    }
}

static void receive_pps_cases(CanConformance* state, Dspic33* cpu) {
    expect(state, !dspic33_can_input_pin(cpu, 63u, true, 0u),
           "CAN input rejects non-remappable pin");
    for (uint8_t transmit_channel = 0u; transmit_channel < DSPIC33_CAN_COUNT;
         transmit_channel++) {
        uint8_t receive_channel = (uint8_t)(transmit_channel ^ 1u);
        uint8_t pin = (uint8_t)(64u + transmit_channel);
        uint16_t transmit_base = bases[transmit_channel];
        uint16_t receive_base = bases[receive_channel];
        uint32_t transmit_memory = (uint32_t)(0xd800u + transmit_channel * 0x100u);
        uint32_t receive_memory = (uint32_t)(0xda00u + transmit_channel * 0x100u);
        Dspic33CanFrame input =
            frame(transmit_channel == 0u ? 0x345u : 0x1234567u, transmit_channel != 0u,
                  false, 3u, (uint8_t)(0x60u + transmit_channel * 0x10u));
        dspic33_reset(cpu, 0u);
        dspic33_write_word(cpu, 0x0e30u, 0xffffu);
        dspic33_write_word(cpu, 0x0e3eu, 0u);
        dspic33_write_word(cpu, 0x0680u, 0x0f0eu);
        dspic33_write_word(cpu, 0x06d4u, (uint16_t)(pin | ((uint16_t)pin << 8u)));
        configure_receive(cpu, receive_channel, receive_memory, 4u, 0u);
        configure_filter(cpu, receive_channel, 0u, input.identifier, input.extended,
                         input.extended ? 0x1fffffffu : 0x7ffu, true, 0u, 0u);
        enable_filter(cpu, receive_channel, 1u);
        configure_transmit(cpu, transmit_channel, transmit_memory);
        write_transmit_frame(cpu, transmit_memory, &input);
        select_window(cpu, transmit_channel, false);
        select_window(cpu, receive_channel, false);
        dspic33_write_word(cpu, (uint16_t)(transmit_base + 0x10u), 0u);
        dspic33_write_word(cpu, (uint16_t)(transmit_base + 0x12u),
                           transmit_channel == 0u ? 0u : 0x0311u);
        dspic33_write_word(cpu, (uint16_t)(receive_base + 0x10u), 0u);
        dspic33_write_word(cpu, (uint16_t)(receive_base + 0x12u),
                           transmit_channel == 0u ? 0u : 0x0311u);
        set_mode(cpu, transmit_channel, 0u);
        set_mode(cpu, receive_channel, 0u);
        dspic33_write_word(cpu, (uint16_t)(transmit_base + 0x30u), 0x008bu);
        bool acknowledge_observed = false;
        expect(state,
               dspic33_device_advance(cpu, 8u) &&
                   bridge_can_pins(
                       cpu, transmit_channel, pin, (uint8_t)(65u - transmit_channel),
                       transmit_channel == 0u ? 4u : 10u, -1, &acknowledge_observed),
               "CAN PPS serial frame bridge advances");
        expect(state,
               receive_full(cpu, receive_channel, 0u) &&
                   cpu->io.can_rx_serial_count[receive_channel] != 0u &&
                   (cpu->io.can_rx_serial_active & (uint8_t)(1u << receive_channel)) ==
                       0u,
               "CAN PPS receiver accepts a complete stuffed frame");
        expect(state,
               memory_word(cpu, receive_memory) ==
                       (uint16_t)(((input.extended ? (input.identifier >> 18u) & 0x7ffu
                                                   : input.identifier)
                                   << 2u) |
                                  (input.extended ? 3u : 0u)) &&
                   (uint8_t)memory_word(cpu, receive_memory + 6u) == input.data[0] &&
                   (uint8_t)(memory_word(cpu, receive_memory + 6u) >> 8u) ==
                       input.data[1],
               "CAN PPS receiver preserves header and payload bits");
        expect(
            state,
            acknowledge_observed &&
                (dspic33_read_word(cpu, (uint16_t)(transmit_base + 0x30u)) & 0x0010u) ==
                    0u &&
                (dspic33_read_word(cpu, (uint16_t)(transmit_base + 0x0eu)) >> 8u) == 0u,
            "CAN PPS receiver drives the acknowledge slot dominant");
    }

    dspic33_reset(cpu, 0u);
    dspic33_write_word(cpu, 0x0e30u, 0xffffu);
    dspic33_write_word(cpu, 0x0e3eu, 0u);
    dspic33_write_word(cpu, 0x0680u, 0x0f0eu);
    dspic33_write_word(cpu, 0x06d4u, 0x4000u);
    configure_receive(cpu, 1u, 0xdc00u, 4u, 0u);
    configure_filter(cpu, 1u, 0u, 0u, false, 0x7ffu, true, 0u, 0u);
    enable_filter(cpu, 1u, 1u);
    configure_transmit(cpu, 0u, 0xde00u);
    Dspic33CanFrame invalid = frame(0u, false, false, 0u, 0u);
    write_transmit_frame(cpu, 0xde00u, &invalid);
    select_window(cpu, 0u, false);
    select_window(cpu, 1u, false);
    dspic33_write_word(cpu, 0x050cu, 0x0080u);
    set_mode(cpu, 0u, 0u);
    set_mode(cpu, 1u, 0u);
    dspic33_write_word(cpu, 0x0430u, 0x008bu);
    bool acknowledge_observed = false;
    expect(state,
           dspic33_device_advance(cpu, 8u) &&
               bridge_can_pins(cpu, 0u, 64u, 65u, 4u, 42, &acknowledge_observed),
           "corrupted CAN PPS frame advances");
    expect(state,
           (dspic33_read_word(cpu, 0x050au) & 0x0080u) != 0u &&
               !receive_full(cpu, 1u, 0u),
           "corrupted CAN PPS frame raises IVRIF without receive data");
}

static void receive_pps_qualification_cases(CanConformance* state, Dspic33* cpu) {
    static const uint8_t modes[] = {0u, 3u, 7u, 2u, 4u, 1u};
    for (uint8_t index = 0u; index < sizeof(modes); index++) {
        uint8_t mode = modes[index];
        dspic33_reset(cpu, 0u);
        dspic33_write_word(cpu, 0x0e30u, 0xffffu);
        dspic33_write_word(cpu, 0x0e3eu, 0u);
        dspic33_write_word(cpu, 0x06d4u, 64u);
        set_mode(cpu, 0u, mode);
        expect(state,
               dspic33_can_input_pin(cpu, 64u, false, 0u) &&
                   dspic33_device_advance(cpu, 0u) &&
                   (((cpu->io.can_rx_serial_active & 1u) != 0u) ==
                    (mode == 0u || mode == 3u || mode == 7u)),
               "CAN receive mode qualifies physical start of frame");
    }

    dspic33_reset(cpu, 0u);
    dspic33_write_word(cpu, 0x0e30u, 0xfffeu);
    dspic33_write_word(cpu, 0x0e3eu, 0u);
    dspic33_write_word(cpu, 0x06d4u, 64u);
    set_mode(cpu, 0u, 0u);
    expect(state,
           dspic33_can_input_pin(cpu, 64u, false, 0u) &&
               dspic33_device_advance(cpu, 0u) &&
               (cpu->io.can_rx_serial_active & 1u) == 0u,
           "CAN PPS receiver rejects an output pin");

    dspic33_reset(cpu, 0u);
    dspic33_write_word(cpu, 0x0e30u, 0xffffu);
    dspic33_write_word(cpu, 0x0e3eu, 0x0040u);
    dspic33_write_word(cpu, 0x06d4u, 70u);
    set_mode(cpu, 0u, 0u);
    expect(state,
           dspic33_can_input_pin(cpu, 70u, false, 0u) &&
               dspic33_device_advance(cpu, 0u) &&
               (cpu->io.can_rx_serial_active & 1u) == 0u,
           "CAN PPS receiver rejects an analog pin");

    dspic33_reset(cpu, 0u);
    dspic33_write_word(cpu, 0x0e30u, 0xffffu);
    dspic33_write_word(cpu, 0x0e3eu, 0u);
    dspic33_write_word(cpu, 0x06d4u, 65u);
    set_mode(cpu, 0u, 0u);
    expect(state,
           dspic33_can_input_pin(cpu, 64u, false, 0u) &&
               dspic33_device_advance(cpu, 0u) &&
               (cpu->io.can_rx_serial_active & 1u) == 0u,
           "CAN PPS receiver rejects an unmapped pin");

    dspic33_reset(cpu, 0u);
    dspic33_write_word(cpu, 0x0e30u, 0xffffu);
    dspic33_write_word(cpu, 0x0e3eu, 0u);
    dspic33_write_word(cpu, 0x06d4u, 64u);
    set_mode(cpu, 0u, 0u);
    dspic33_write_word(cpu, 0x0760u, (uint16_t)(dspic33_read_word(cpu, 0x0760u) | 2u));
    expect(state,
           dspic33_device_advance(cpu, 1u) &&
               dspic33_can_input_pin(cpu, 64u, false, 0u) &&
               dspic33_device_advance(cpu, 0u) &&
               (cpu->io.can_rx_serial_active & 1u) == 0u,
           "PMD suppresses the CAN PPS receiver");

    dspic33_reset(cpu, 0u);
    dspic33_write_word(cpu, 0x0e30u, 0xffffu);
    dspic33_write_word(cpu, 0x0e3eu, 0u);
    dspic33_write_word(cpu, 0x06d4u, 64u);
    dspic33_write_word(cpu, 0x0412u, 0u);
    set_mode(cpu, 0u, 0u);
    cpu->power_state = DSPIC33_POWER_SLEEP;
    expect(state,
           dspic33_can_input_pin(cpu, 64u, false, 0u) &&
               dspic33_device_advance(cpu, 0u) &&
               (dspic33_read_word(cpu, 0x040au) & 0x0040u) == 0u,
           "disabled CAN wake filter rejects physical bus activity");

    dspic33_reset(cpu, 0u);
    dspic33_write_word(cpu, 0x0e30u, 0xffffu);
    dspic33_write_word(cpu, 0x0e3eu, 0u);
    dspic33_write_word(cpu, 0x06d4u, 64u);
    dspic33_write_word(cpu, 0x0412u, 0x4000u);
    set_mode(cpu, 0u, 0u);
    cpu->power_state = DSPIC33_POWER_SLEEP;
    expect(state,
           dspic33_can_input_pin(cpu, 64u, false, 0u) &&
               dspic33_device_advance(cpu, 0u) &&
               (dspic33_read_word(cpu, 0x040au) & 0x0040u) != 0u,
           "enabled CAN wake filter accepts physical bus activity");
}

static void priority_and_abort_cases(CanConformance* state, Dspic33* cpu) {
    Dspic33CanFrame output;
    uint8_t buffer;
    dspic33_reset(cpu, 0u);
    configure_transmit(cpu, 0u, 0xb000u);
    for (buffer = 0u; buffer < 8u; buffer++) {
        write_memory_word(cpu, (uint32_t)(0xb000u + buffer * 16u),
                          (uint16_t)((0x100u + buffer) << 2u));
        write_memory_word(cpu, (uint32_t)(0xb004u + buffer * 16u), 0u);
    }
    set_mode(cpu, 0u, 0u);
    dspic33_write_word(cpu, 0x0430u, 0x8988u);
    dspic33_write_word(cpu, 0x0432u, 0x8a8bu);
    dspic33_write_word(cpu, 0x0434u, 0x8a89u);
    dspic33_write_word(cpu, 0x0436u, 0x8b8bu);
    expect(state, dspic33_device_advance(cpu, 32768u), "priority transmissions");
    expect(state, dspic33_can_transmit(cpu, 0u, &output) && output.identifier == 0x107u,
           "highest priority natural order");
    expect(state, dspic33_can_transmit(cpu, 0u, &output) && output.identifier == 0x106u,
           "second highest natural order");
    dspic33_reset(cpu, 0u);
    select_window(cpu, 0u, false);
    dspic33_write_word(cpu, 0x0430u, 0x8989u);
    dspic33_write_word(cpu, 0x0400u,
                       (uint16_t)(dspic33_read_word(cpu, 0x0400u) | 0x1000u));
    expect(state, (dspic33_read_word(cpu, 0x0430u) & 0x4848u) == 0x4040u,
           "abort flags and request clear");
    expect(state, (dspic33_read_word(cpu, 0x0400u) & 0x1000u) == 0u,
           "abort all self clear");
}

static void mode_and_power_cases(CanConformance* state, Dspic33* cpu) {
    static const uint8_t modes[] = {0u, 1u, 2u, 3u, 4u, 7u};
    uint8_t index;
    for (index = 0u; index < sizeof(modes); index++) {
        uint8_t mode = modes[index];
        Dspic33CanFrame input = frame(0x234u, false, false, 1u, mode);
        dspic33_reset(cpu, 0u);
        configure_receive(cpu, 0u, 0xc000u, 4u, 0u);
        configure_filter(cpu, 0u, 0u, 0x234u, false, 0x7ffu, true, 0u, 0u);
        enable_filter(cpu, 0u, mode == 7u ? 0u : 1u);
        select_window(cpu, 0u, false);
        set_mode(cpu, 0u, mode);
        expect(state, ((dspic33_read_word(cpu, 0x0400u) >> 5u) & 7u) == mode,
               "mode acknowledgement matrix");
        expect(state,
               dspic33_can_receive(cpu, 0u, &input, 0u) &&
                   dspic33_device_advance(cpu, 32u),
               "mode receive schedule");
        expect(state,
               receive_full(cpu, 0u, 0u) ==
                   (mode == 0u || mode == 2u || mode == 3u || mode == 7u),
               "mode receive behavior");
    }
    dspic33_reset(cpu, 0u);
    configure_receive(cpu, 0u, 0xc000u, 4u, 0u);
    configure_filter(cpu, 0u, 0u, 0x234u, false, 0x7ffu, true, 0u, 0u);
    enable_filter(cpu, 0u, 1u);
    select_window(cpu, 0u, false);
    set_mode(cpu, 0u, 0u);
    dspic33_write_word(cpu, 0x0760u, (uint16_t)(dspic33_read_word(cpu, 0x0760u) | 2u));
    {
        Dspic33CanFrame input = frame(0x234u, false, false, 1u, 0u);
        expect(state,
               dspic33_can_receive(cpu, 0u, &input, 0u) &&
                   dspic33_device_advance(cpu, 32u),
               "PMD receive schedule");
        expect(state, !receive_full(cpu, 0u, 0u), "PMD blocks receive");
    }
    dspic33_reset(cpu, 0u);
    dspic33_write_word(cpu, 0x040cu, 0x0040u);
    cpu->power_state = DSPIC33_POWER_SLEEP;
    {
        Dspic33CanFrame input = frame(0x234u, false, false, 1u, 0u);
        expect(state,
               dspic33_can_receive(cpu, 0u, &input, 0u) &&
                   dspic33_device_advance(cpu, 1u),
               "unfiltered sleep activity schedule");
        expect(state, (dspic33_read_word(cpu, 0x040au) & 0x0040u) == 0u,
               "disabled CAN wake filter rejects sleep activity");
    }
    dspic33_reset(cpu, 0u);
    dspic33_write_word(cpu, 0x0412u, 0x4000u);
    dspic33_write_word(cpu, 0x040cu, 0x0040u);
    cpu->power_state = DSPIC33_POWER_SLEEP;
    {
        Dspic33CanFrame input = frame(0x234u, false, false, 1u, 0u);
        expect(state,
               dspic33_can_receive(cpu, 0u, &input, 0u) &&
                   dspic33_device_advance(cpu, 1u),
               "filtered sleep wake schedule");
        expect(state, (dspic33_read_word(cpu, 0x040au) & 0x0040u) != 0u,
               "enabled CAN wake filter raises wake flag");
    }
}

