tylertms/dspic33e-sim/conformance/can.c
static void capture_timestamp_cases(CanConformance* state, Dspic33* cpu) {
    for (uint8_t channel = 0u; channel < DSPIC33_CAN_COUNT; channel++) {
        uint16_t base = bases[channel];
        uint32_t memory = (uint32_t)(0xc800u + channel * 0x100u);
        Dspic33CanFrame input = frame(0x345u, false, false, 1u, 0x5au);
        dspic33_reset(cpu, 0u);
        configure_receive(cpu, channel, memory, 4u, 0u);
        configure_filter(cpu, channel, 0u, 0x345u, false, 0x7ffu, true, 0u, 0u);
        enable_filter(cpu, channel, 1u);
        select_window(cpu, channel, false);
        dspic33_write_word(cpu, (uint16_t)(base + 0x10u), 0u);
        dspic33_write_word(cpu, (uint16_t)(base + 0x12u), 0u);
        set_mode(cpu, channel, 0u);
        dspic33_write_word(cpu, 0x0148u, 0u);
        dspic33_write_word(cpu, 0x014au, 0u);
        dspic33_write_word(cpu, 0x0148u, 0x1c03u);
        dspic33_write_word(cpu, base,
                           (uint16_t)(dspic33_read_word(cpu, base) | 0x0008u));
        expect(state,
               dspic33_can_receive(cpu, channel, &input, 0u) &&
                   dspic33_device_advance(cpu, 0u) &&
                   (cpu->io.input_capture.input_high & 2u) != 0u,
               "CAN timestamp pulse starts after frame acceptance");
        expect(state,
               dspic33_device_advance(cpu, 3u) &&
                   (cpu->io.input_capture.input_high & 2u) != 0u,
               "CAN timestamp pulse remains high before one bit time");
        expect(state,
               dspic33_device_advance(cpu, 1u) &&
                   cpu->io.input_capture.fifo[1].count == 1u &&
                   (cpu->io.input_capture.input_high & 2u) == 0u,
               "CAN timestamp pulse clears after one bit time");
        dspic33_write_word(cpu, 0x06aeu, 0x4000u);
        expect(state,
               dspic33_input_capture_pin(cpu, 64u, false, 0u) &&
                   dspic33_device_advance(cpu, 0u) &&
                   dspic33_input_capture_pin(cpu, 64u, true, 0u) &&
                   dspic33_device_advance(cpu, 1u),
               "IC2 pin edge advances while CAN capture is selected");
        expect(state, cpu->io.input_capture.fifo[1].count == 1u,
               "CANCAP disconnects the physical IC2 pin");
        dspic33_write_word(cpu, base,
                           (uint16_t)(dspic33_read_word(cpu, base) & ~0x0008u));
        expect(state,
               dspic33_input_capture_pin(cpu, 64u, false, 0u) &&
                   dspic33_device_advance(cpu, 0u) &&
                   dspic33_input_capture_pin(cpu, 64u, true, 0u) &&
                   dspic33_device_advance(cpu, 1u),
               "IC2 pin edge advances after CAN capture is cleared");
        expect(state, cpu->io.input_capture.fifo[1].count == 2u,
               "clearing CANCAP restores the physical IC2 pin");

        dspic33_reset(cpu, 0u);
        configure_receive(cpu, channel, memory, 4u, 0u);
        configure_filter(cpu, channel, 0u, 0x345u, false, 0x7ffu, true, 0u, 0u);
        enable_filter(cpu, channel, 1u);
        select_window(cpu, channel, false);
        set_mode(cpu, channel, 0u);
        dspic33_write_word(cpu, 0x0148u, 0x1c03u);
        expect(state,
               dspic33_can_receive(cpu, channel, &input, 0u) &&
                   dspic33_device_advance(cpu, 32u),
               "disabled CAN timestamp receive schedule");
        expect(state, cpu->io.input_capture.fifo[1].count == 0u,
               "CANCAP clear preserves the IC2 pin source");
    }
}

static uint16_t expected_error_status(bool transmit, uint16_t count, bool bus_off) {
    uint16_t status = 0u;
    if (count >= 96u) {
        status |= CAN_ERROR_WARNING;
        if (transmit) {
            if (count < 128u) {
                status |= CAN_TRANSMIT_WARNING;
            } else if (!bus_off) {
                status |= CAN_TRANSMIT_PASSIVE;
            }
        } else {
            if (count < 128u) {
                status |= CAN_RECEIVE_WARNING;
            } else {
                status |= CAN_RECEIVE_PASSIVE;
            }
        }
    }
    if (bus_off) {
        status |= CAN_BUS_OFF;
    }
    return status;
}

static void configure_error_test(Dspic33* cpu, uint8_t channel) {
    dspic33_reset(cpu, 0u);
    set_mode(cpu, channel, 0u);
    dspic33_write_word(cpu, (uint16_t)(bases[channel] + 0x0cu), CAN_INTERRUPT_ERROR);
}

static void expect_error_step(CanConformance* state, Dspic33* cpu, uint8_t channel,
                              bool transmit, uint8_t increment,
                              uint16_t expected_counts, uint16_t expected_status) {
    uint16_t status_address = (uint16_t)(bases[channel] + 0x0au);
    uint16_t status;
    expect(state,
           dspic33_can_error(cpu, channel, transmit, increment, 0u) &&
               dspic33_device_advance(cpu, 1u),
           "error counter event schedule");
    status = dspic33_read_word(cpu, status_address);
    expect(state,
           dspic33_read_word(cpu, (uint16_t)(bases[channel] + 0x0eu)) ==
               expected_counts,
           "error counter result");
    expect(state, (status & CAN_ERROR_STATUS_MASK) == expected_status,
           "error state result");
    expect(state, (status & CAN_INTERRUPT_ERROR) == 0u,
           "B1 error transition leaves ERRIF clear");
    expect(state, !interrupt_flag(cpu, event_irqs[channel]),
           "B1 error transition does not interrupt");
    expect(state,
           (dspic33_read_word(cpu, (uint16_t)(bases[channel] + 4u)) & 0x007fu) == 0x40u,
           "B1 error transition keeps default vector");
}

static void clear_error_interrupt(CanConformance* state, Dspic33* cpu,
                                  uint8_t channel) {
    uint16_t address = (uint16_t)(bases[channel] + 0x0au);
    dspic33_write_word(
        cpu, address,
        (uint16_t)(dspic33_read_word(cpu, address) & ~CAN_INTERRUPT_ERROR));
    clear_interrupt_flag(cpu, event_irqs[channel]);
    expect(state, (dspic33_read_word(cpu, address) & CAN_INTERRUPT_ERROR) == 0u,
           "error flag clear");
    expect(state, !interrupt_flag(cpu, event_irqs[channel]), "error interrupt clear");
    expect(state,
           (dspic33_read_word(cpu, (uint16_t)(bases[channel] + 4u)) & 0x007fu) == 0x40u,
           "error vector clear");
}

static void error_threshold_domain(CanConformance* state, Dspic33* cpu) {
    uint8_t channel;
    for (channel = 0u; channel < DSPIC33_CAN_COUNT; channel++) {
        uint8_t direction;
        for (direction = 0u; direction < 2u; direction++) {
            bool transmit = direction != 0u;
            uint16_t count;
            for (count = 1u; count <= UINT8_MAX; count++) {
                uint16_t counts = transmit ? (uint16_t)(count << 8u) : count;
                configure_error_test(cpu, channel);
                expect_error_step(state, cpu, channel, transmit, (uint8_t)count, counts,
                                  expected_error_status(transmit, count, false));
            }
        }
    }
}

