tylertms/dspic33e-sim/conformance/can.c
static void receive_error_transition_cases(CanConformance* state, Dspic33* cpu,
                                           uint8_t channel) {
    configure_error_test(cpu, channel);
    expect_error_step(state, cpu, channel, false, 95u, 0x005fu, 0u);
    expect_error_step(state, cpu, channel, false, 1u, 0x0060u,
                      CAN_ERROR_WARNING | CAN_RECEIVE_WARNING);
    clear_error_interrupt(state, cpu, channel);
    expect_error_step(state, cpu, channel, false, 1u, 0x0061u,
                      CAN_ERROR_WARNING | CAN_RECEIVE_WARNING);
    expect_error_step(state, cpu, channel, false, 31u, 0x0080u,
                      CAN_ERROR_WARNING | CAN_RECEIVE_PASSIVE);
    clear_error_interrupt(state, cpu, channel);
    expect_error_step(state, cpu, channel, false, 1u, 0x0081u,
                      CAN_ERROR_WARNING | CAN_RECEIVE_PASSIVE);
    expect_error_step(state, cpu, channel, false, 126u, 0x00ffu,
                      CAN_ERROR_WARNING | CAN_RECEIVE_PASSIVE);
    expect_error_step(state, cpu, channel, false, 1u, 0x00ffu,
                      CAN_ERROR_WARNING | CAN_RECEIVE_PASSIVE);
    set_mode(cpu, channel, 4u);
    expect(state, dspic33_read_word(cpu, (uint16_t)(bases[channel] + 0x0eu)) == 0u,
           "configuration clears receive error counter");
    expect(state,
           (dspic33_read_word(cpu, (uint16_t)(bases[channel] + 0x0au)) &
            CAN_ERROR_STATUS_MASK) == 0u,
           "configuration clears receive error state");
    set_mode(cpu, channel, 0u);
    expect_error_step(state, cpu, channel, false, 96u, 0x0060u,
                      CAN_ERROR_WARNING | CAN_RECEIVE_WARNING);
}

static void transmit_error_transition_cases(CanConformance* state, Dspic33* cpu,
                                            uint8_t channel) {
    configure_error_test(cpu, channel);
    expect_error_step(state, cpu, channel, true, 95u, 0x5f00u, 0u);
    expect_error_step(state, cpu, channel, true, 1u, 0x6000u,
                      CAN_ERROR_WARNING | CAN_TRANSMIT_WARNING);
    clear_error_interrupt(state, cpu, channel);
    expect_error_step(state, cpu, channel, true, 1u, 0x6100u,
                      CAN_ERROR_WARNING | CAN_TRANSMIT_WARNING);
    expect_error_step(state, cpu, channel, true, 31u, 0x8000u,
                      CAN_ERROR_WARNING | CAN_TRANSMIT_PASSIVE);
    clear_error_interrupt(state, cpu, channel);
    expect_error_step(state, cpu, channel, true, 1u, 0x8100u,
                      CAN_ERROR_WARNING | CAN_TRANSMIT_PASSIVE);
    expect_error_step(state, cpu, channel, true, 126u, 0xff00u,
                      CAN_ERROR_WARNING | CAN_TRANSMIT_PASSIVE);
    expect_error_step(state, cpu, channel, true, 1u, 0xff00u,
                      CAN_ERROR_WARNING | CAN_BUS_OFF);
    clear_error_interrupt(state, cpu, channel);
    expect_error_step(state, cpu, channel, true, 1u, 0xff00u,
                      CAN_ERROR_WARNING | CAN_BUS_OFF);
    set_mode(cpu, channel, 4u);
    expect(state, dspic33_read_word(cpu, (uint16_t)(bases[channel] + 0x0eu)) == 0u,
           "configuration clears transmit error counter");
    expect(state,
           (dspic33_read_word(cpu, (uint16_t)(bases[channel] + 0x0au)) &
            CAN_ERROR_STATUS_MASK) == 0u,
           "configuration clears bus off state");
    set_mode(cpu, channel, 0u);
    expect_error_step(state, cpu, channel, true, 96u, 0x6000u,
                      CAN_ERROR_WARNING | CAN_TRANSMIT_WARNING);
}

static void complete_error_test_transmission(CanConformance* state, Dspic33* cpu,
                                             uint8_t channel) {
    uint32_t memory = (uint32_t)(0xe000u + channel * 0x100u);
    Dspic33CanFrame output;
    uint8_t word;
    configure_transmit(cpu, channel, memory);
    for (word = 0u; word < 8u; word++) {
        write_memory_word(cpu, memory + word * 2u, 0u);
    }
    select_window(cpu, channel, false);
    dspic33_write_word(cpu, (uint16_t)(bases[channel] + 0x30u), 0x008bu);
    expect(state, dspic33_device_advance(cpu, 4096u),
           "error recovery transmission advance");
    expect(state, dspic33_can_transmit(cpu, channel, &output),
           "error recovery transmission output");
}

static void transmit_error_descending_entry_cases(CanConformance* state, Dspic33* cpu,
                                                  uint8_t channel) {
    uint16_t status_address = (uint16_t)(bases[channel] + 0x0au);
    configure_error_test(cpu, channel);
    expect_error_step(state, cpu, channel, true, 128u, 0x8000u,
                      CAN_ERROR_WARNING | CAN_TRANSMIT_PASSIVE);
    clear_error_interrupt(state, cpu, channel);
    complete_error_test_transmission(state, cpu, channel);
    expect(state, dspic33_read_word(cpu, (uint16_t)(bases[channel] + 0x0eu)) == 0x7f00u,
           "successful transmission decrements error counter");
    expect(state,
           (dspic33_read_word(cpu, status_address) & CAN_ERROR_STATUS_MASK) ==
               (CAN_ERROR_WARNING | CAN_TRANSMIT_WARNING),
           "successful transmission enters error warning");
    expect(state, (dspic33_read_word(cpu, status_address) & CAN_INTERRUPT_ERROR) == 0u,
           "B1 descending error transition leaves ERRIF clear");
    expect(state, !interrupt_flag(cpu, event_irqs[channel]),
           "B1 descending error transition does not interrupt");
    expect(state,
           (dspic33_read_word(cpu, (uint16_t)(bases[channel] + 4u)) & 0x007fu) == 0x40u,
           "B1 descending error transition keeps default vector");
    clear_error_interrupt(state, cpu, channel);
    complete_error_test_transmission(state, cpu, channel);
    expect(state, dspic33_read_word(cpu, (uint16_t)(bases[channel] + 0x0eu)) == 0x7e00u,
           "within-warning transmission decrements error counter");
    expect(state,
           (dspic33_read_word(cpu, status_address) & CAN_ERROR_STATUS_MASK) ==
               (CAN_ERROR_WARNING | CAN_TRANSMIT_WARNING),
           "within-warning transmission preserves error state");
    expect(state, (dspic33_read_word(cpu, status_address) & CAN_INTERRUPT_ERROR) == 0u,
           "within-warning transmission does not set error flag");
    expect(state, !interrupt_flag(cpu, event_irqs[channel]),
           "within-warning transmission does not raise error interrupt");
    expect(state,
           (dspic33_read_word(cpu, (uint16_t)(bases[channel] + 4u)) & 0x007fu) == 0x40u,
           "within-warning transmission keeps default vector");
}

static void interrupt_and_error_cases(CanConformance* state, Dspic33* cpu) {
    uint8_t channel;
    error_threshold_domain(state, cpu);
    for (channel = 0u; channel < DSPIC33_CAN_COUNT; channel++) {
        receive_error_transition_cases(state, cpu, channel);
        transmit_error_transition_cases(state, cpu, channel);
        transmit_error_descending_entry_cases(state, cpu, channel);
    }
}

static void invalid_message_cases(CanConformance* state, Dspic33* cpu) {
    expect(state, !dspic33_can_invalid(cpu, DSPIC33_CAN_COUNT, 0u),
           "invalid CAN message rejects unavailable channel");
    for (uint8_t channel = 0u; channel < DSPIC33_CAN_COUNT; channel++) {
        uint16_t base = bases[channel];
        dspic33_reset(cpu, 0u);
        set_mode(cpu, channel, 0u);
        dspic33_write_word(cpu, (uint16_t)(base + 0x0cu), 0x0080u);
        clear_interrupt_flag(cpu, event_irqs[channel]);
        expect(state, dspic33_can_invalid(cpu, channel, 2u),
               "schedule invalid CAN message");
        expect(state,
               dspic33_device_advance(cpu, 1u) &&
                   (dspic33_read_word(cpu, (uint16_t)(base + 0x0au)) & 0x0080u) == 0u &&
                   !interrupt_flag(cpu, event_irqs[channel]),
               "invalid CAN message waits for its event boundary");
        expect(state,
               dspic33_device_advance(cpu, 1u) &&
                   (dspic33_read_word(cpu, (uint16_t)(base + 0x0au)) & 0x0080u) != 0u &&
                   interrupt_flag(cpu, event_irqs[channel]) &&
                   (dspic33_read_word(cpu, (uint16_t)(base + 4u)) & 0x007fu) == 0x40u,
               "invalid CAN message raises IVRIF and the event interrupt");
        dspic33_write_word(
            cpu, (uint16_t)(base + 0x0au),
            (uint16_t)(dspic33_read_word(cpu, (uint16_t)(base + 0x0au)) & ~0x0080u));
        clear_interrupt_flag(cpu, event_irqs[channel]);
        expect(state,
               (dspic33_read_word(cpu, (uint16_t)(base + 0x0au)) & 0x0080u) == 0u &&
                   !interrupt_flag(cpu, event_irqs[channel]),
               "software clears the invalid CAN message event");

        dspic33_reset(cpu, 0u);
        expect(state,
               dspic33_can_invalid(cpu, channel, 0u) &&
                   dspic33_device_advance(cpu, 0u) &&
                   (dspic33_read_word(cpu, (uint16_t)(base + 0x0au)) & 0x0080u) == 0u,
               "configuration mode suppresses invalid CAN message events");

        dspic33_reset(cpu, 0u);
        set_mode(cpu, channel, 0u);
        dspic33_write_word(
            cpu, 0x0760u,
            (uint16_t)(dspic33_read_word(cpu, 0x0760u) | (uint16_t)(2u << channel)));
        expect(state,
               dspic33_can_invalid(cpu, channel, 0u) &&
                   dspic33_device_advance(cpu, 1u) &&
                   (dspic33_read_word(cpu, (uint16_t)(base + 0x0au)) & 0x0080u) == 0u,
               "PMD-disabled CAN suppresses invalid message events");
    }
}

static void copy_and_reset_cases(CanConformance* state, Dspic33* cpu) {
    Dspic33 copy;
    bool initialized = dspic33_initialize(&copy);
    Dspic33CanFrame input = frame(0x456u, false, false, 3u, 0x70u);
    expect(state, initialized, "initialize CAN copy");
    if (!initialized) {
        return;
    }
    dspic33_reset(cpu, 0u);
    configure_receive(cpu, 0u, 0xd000u, 4u, 0u);
    configure_filter(cpu, 0u, 0u, 0x456u, false, 0x7ffu, true, 0u, 0u);
    enable_filter(cpu, 0u, 1u);
    select_window(cpu, 0u, false);
    set_mode(cpu, 0u, 0u);
    expect(state, dspic33_can_receive(cpu, 0u, &input, 2u),
           "copy pending receive schedule");
    expect(state, dspic33_copy(&copy, cpu), "copy pending CAN state");
    expect(state,
           dspic33_device_advance(cpu, 32u) && dspic33_device_advance(&copy, 32u),
           "copy advance");
    expect(state, receive_full(cpu, 0u, 0u) && receive_full(&copy, 0u, 0u),
           "copy receives identically");
    expect(state, memory_word(cpu, 0xd000u) == memory_word(&copy, 0xd000u),
           "copy DMA contents");
    dspic33_reset(cpu, 0u);
    dspic33_write_word(cpu, 0x0680u, 14u);
    configure_transmit(cpu, 0u, 0xd100u);
    write_memory_word(cpu, 0xd100u, 2u);
    for (uint8_t word = 1u; word < 8u; word++) {
        write_memory_word(cpu, 0xd100u + word * 2u, 0u);
    }
    select_window(cpu, 0u, false);
    set_mode(cpu, 0u, 0u);
    dspic33_write_word(cpu, 0x0430u, 0x008bu);
    expect(state, dspic33_device_advance(cpu, 8u) && (cpu->io.can_tx_busy & 1u) != 0u,
           "copy reaches pending CAN bus completion");
    expect(state, dspic33_copy(&copy, cpu), "copy pending CAN bus state");
    expect(state,
           dspic33_device_advance(cpu, 20u) && dspic33_device_advance(&copy, 20u),
           "copied CAN bus phases advance");
    bool source_high;
    bool copy_high;
    expect(state,
           dspic33_can_pin(cpu, 64u, &source_high) &&
               dspic33_can_pin(&copy, 64u, &copy_high) && source_high && copy_high,
           "copy preserves CAN transmit bit phase");
    expect(state,
           dspic33_device_advance(cpu, 980u) && dspic33_device_advance(&copy, 980u),
           "copied CAN bus completions advance");
    Dspic33CanFrame source_output;
    Dspic33CanFrame copy_output;
    expect(state,
           dspic33_can_transmit(cpu, 0u, &source_output) &&
               dspic33_can_transmit(&copy, 0u, &copy_output) &&
               source_output.identifier == copy_output.identifier,
           "copy preserves pending CAN bus completion");
    dspic33_reset(cpu, 0u);
    dspic33_write_word(cpu, 0x0e30u, 0xffffu);
    dspic33_write_word(cpu, 0x0e3eu, 0u);
    dspic33_write_word(cpu, 0x06d4u, 64u);
    set_mode(cpu, 0u, 0u);
    expect(state,
           dspic33_can_input_pin(cpu, 64u, false, 0u) &&
               dspic33_device_advance(cpu, 3u) &&
               cpu->io.can_rx_serial_count[0] == 1u &&
               (cpu->io.can_rx_serial_active & 1u) != 0u,
           "copy reaches active CAN serial reception");
    expect(state, dspic33_copy(&copy, cpu), "copy active CAN serial state");
    expect(state,
           dspic33_can_input_pin(cpu, 64u, true, 1u) &&
               dspic33_can_input_pin(&copy, 64u, true, 1u) &&
               dspic33_device_advance(cpu, 4u) && dspic33_device_advance(&copy, 4u) &&
               cpu->io.can_rx_serial_count[0] == 2u &&
               copy.io.can_rx_serial_count[0] == 2u &&
               cpu->io.can_rx_serial_bits[0][1] == copy.io.can_rx_serial_bits[0][1],
           "copy preserves CAN serial receive phase");
    dspic33_destroy(&copy);
    dspic33_reset(cpu, 0u);
    expect(state,
           cpu->io.can_rx[0].count == 0u && cpu->io.can_tx[0].count == 0u &&
               cpu->io.can_rx_busy == 0u && cpu->io.can_tx_busy == 0u &&
               cpu->io.can_rx_serial_active == 0u &&
               cpu->io.can_rx_serial_count[0] == 0u && cpu->io.can_rx_pin_high == 3u &&
               cpu->io.can_rx_ack == 0u && cpu->io.can_tx_retry_wait == 0u &&
               cpu->io.can_tx_error_active == 0u,
           "reset clears CAN runtime");
}

int main(void) {
    CanConformance state = {0u, 0u, 0u};
    Dspic33 cpu;
    if (!dspic33_initialize(&cpu)) {
        fprintf(stderr, "[can-error] cannot initialize emulator\n");
        return 2;
    }
    register_cases(&state, &cpu);
    register_access_cases(&state, &cpu);
    interrupt_flag_write_zero_cases(&state, &cpu);
    standard_filter_domain(&state, &cpu);
    extended_filter_cases(&state, &cpu);
    payload_and_remote_cases(&state, &cpu);
    devicenet_cases(&state, &cpu);
    direct_buffer_cases(&state, &cpu);
    fifo_cases(&state, &cpu);
    fifo_overflow_advancement_cases(&state, &cpu);
    receive_flag_write_zero_domain(&state, &cpu);
    receive_overflow_write_zero_prior_domain(&state, &cpu);
    receive_flag_read_pointer_cases(&state, &cpu);
    fifo_interrupt_boundary_cases(&state, &cpu);
    receive_flag_hardware_event_cases(&state, &cpu);
    overflow_and_fallback_cases(&state, &cpu);
    transmission_cases(&state, &cpu);
    clock_timing_cases(&state, &cpu);
    stuffed_frame_timing_cases(&state, &cpu);
    transmit_abort_timing_cases(&state, &cpu);
    transmit_pps_cases(&state, &cpu);
    receive_pps_cases(&state, &cpu);
    arbitration_field_cases(&state, &cpu);
    arbitration_cases(&state, &cpu);
    acknowledge_error_cases(&state, &cpu);
    receive_pps_qualification_cases(&state, &cpu);
    priority_and_abort_cases(&state, &cpu);
    mode_and_power_cases(&state, &cpu);
    capture_timestamp_cases(&state, &cpu);
    interrupt_and_error_cases(&state, &cpu);
    invalid_message_cases(&state, &cpu);
    copy_and_reset_cases(&state, &cpu);
    expect(&state, state.cases == 1462652u, "CAN assertion accounting");
    report_sfr_side_effect_coverage(
        "can", can_sfr_side_effect_coverage,
        SFR_SIDE_EFFECT_COVERAGE_COUNT(can_sfr_side_effect_coverage),
        state.failed == 0u);
    printf("[can-summary] cases=%" PRIu32 " passed=%" PRIu32 " failed=%" PRIu32 "\n",
           state.cases, state.passed, state.failed);
    dspic33_destroy(&cpu);
    return state.failed == 0u ? 0 : 1;
}
